import csv

"""
[응답번째][0] = 날짜
[응답번째][1] = 성별
[응답번째][2] = 광고로 구매 여부
[응답번째][3] = 주로 접하는 매체
[응답번째][4] = 광고를 접했을 때 행동
"""

def main():
    boy = {
        "구매" : 0,
        "매체" : {
            "스" : 0,
            "컴" : 0,
            "태" : 0,
            "T" : 0,
            "잡" : 0
        },
        "행동" : {
            "동" : {
                "c" : 0,
                "p" : 0
            },
            "S" : {
                "c" : 0,
                "p" : 0
            },
            "게" : {
                "c" : 0,
                "p" : 0
            },
            "인" : {
                "c" : 0,
                "p" : 0
            }
        }
    }

    girl = {
        "구매" : 0,
        "매체" : {
            "스" : 0,
            "컴" : 0,
            "태" : 0,
            "T" : 0,
            "잡" : 0
        },
        "행동" : {
            "동" : {
                "c" : 0,
                "p" : 0
            },
            "S" : {
                "c" : 0,
                "p" : 0
            },
            "게" : {
                "c" : 0,
                "p" : 0
            },
            "인" : {
                "c" : 0,
                "p" : 0
            }
        }
    }

    with open('확통_data.csv', 'r', encoding='utf-8') as f:
        data = list(csv.reader(f))[1:]

    for line in data:
        if line[1] == "남":
            if line[2] == "예":
                boy["구매"] += 1
            boy["매체"][line[3][0]] += 1
            boy["행동"][line[4][0]]["c"] += 1
            boy["행동"][line[4][0]]["p"] = round(boy["행동"][line[4][0]]["c"]/32 * 100)

        if line[1] == "여":
            if line[2] == "예":
                girl["구매"] += 1
            girl["매체"][line[3][0]] += 1
            girl["행동"][line[4][0]]["c"] += 1
            girl["행동"][line[4][0]]["p"] = round(girl["행동"][line[4][0]]["c"]/32 * 100)
    
    phone = {
        "man" : {
            "count" : boy['매체']['스'],
            "per" : round(boy['매체']['스']/32 * 100, 3)
        },
        "girl" : {
            "count" : girl['매체']['스'],
            "per" : round(girl['매체']['스']/48 * 100, 3)
        }
    }

    com = {
        "man" : {
            "count" : boy['매체']['컴'],
            "per" : round(boy['매체']['컴']/32 * 100, 3)
        },
        "girl" : {
            "count" : girl['매체']['컴'],
            "per" : round(girl['매체']['컴']/48 * 100, 3)
        }
    }

    tablet = {
        "man" : {
            "count" : boy['매체']['태'],
            "per" : round(boy['매체']['태']/32 * 100, 3)
        },
        "girl" : {
            "count" : girl['매체']['태'],
            "per" : round(girl['매체']['태']/48 * 100, 3)
        }
    }

    t = {
        "man" : {
            "count" : boy['매체']['T'],
            "per" : round(boy['매체']['T']/32 * 100, 3)
        },
        "girl" : {
            "count" : girl['매체']['T'],
            "per" : round(girl['매체']['T']/48 * 100, 3)
        }
    }

    print("=========================")
    print("광고를 보고 구매한 수")
    print("전체 : 80명 중 60명 (전체 중 75%가 구매함)")
    print(f"남자 : 32명 중 {boy['구매']}명 (남자 중 {boy['구매']/32 * 100}%가 구매함)")
    print(f"여자 : 48명 중 {girl['구매']}명 (여자 중 {round(girl['구매']/48 * 100, 3)}%가 구매함)")
    print("=========================")
    print("광고를 주로 접하는 대표 매체들")
    print("전체 : 스마트폰 : 69명(86.3%) / 컴퓨터 : 5명(6.3%) / TV : 5명(6.3%) / 태블릿 : 1명(1.2%) / 잡지 : 0(0%)")
    print(f"남자 : 스마트폰 : {phone['man']['count']}명({phone['man']['per']}%) / 컴퓨터 : {com['man']['count']}명({com['man']['per']}%) / TV : {t['man']['count']}명({t['man']['per']}%) / 태블릿 : {tablet['man']['count']}명({tablet['man']['per']}%) / 잡지 : 0(0%)")
    print(f"여자 : 스마트폰 : {phone['girl']['count']}명({phone['girl']['per']}%) / 컴퓨터 : {com['girl']['count']}명({com['girl']['per']}%) / TV : {t['girl']['count']}명({t['girl']['per']}%) / 태블릿 : {tablet['girl']['count']}명({tablet['girl']['per']}%) / 잡지 : 0(0%)")
    print("=========================")
    print("광고를 주로 접하는 행동")
    print("전체 : 동영상 시청 : 42명(52.5%) / SNS : 33(41.3%) / 게임 : 3명(3.7%) / 인터넷 검색 : 2명(2.5%)")
    print(f"남자 : 동영상 시청 : {boy['행동']['동']['c']}명({boy['행동']['동']['p']}%) / SNS : {boy['행동']['S']['c']}명({boy['행동']['S']['p']}%) / 게임 : {boy['행동']['게']['c']}명({boy['행동']['게']['p']}%) / 인터넷 검색 : {boy['행동']['인']['c']}명({boy['행동']['인']['p']}%)")
    print(f"여자 : 동영상 시청 : {girl['행동']['동']['c']}명({girl['행동']['동']['p']}%) / SNS : {girl['행동']['S']['c']}명({girl['행동']['S']['p']}%) / 게임 : {girl['행동']['게']['c']}명({girl['행동']['게']['p']}%) / 인터넷 검색 : {girl['행동']['인']['c']}명({girl['행동']['인']['p']}%)")
    print("=========================")

main()
